---
kind: type
id: T:Autodesk.Revit.DB.ExportDGNSettings
source: html/3df10700-a305-dba7-fc4a-5afb5387256c.htm
---
# Autodesk.Revit.DB.ExportDGNSettings

This element contains DGN export settings which are saved in a Revit document.

## Syntax (C#)
```csharp
public class ExportDGNSettings : Element
```